package kr.fc.poly3;

// RemoCon 인터페이스 선언
// TV, Radio 등 리모컨으로 조작 가능한 기기들의 공통 기능(함수, 메서드)를 정의하는 인터페이스
// 인터페이스는 메서드의 원형만 정의하고, 구현부는 없음
// 인터페이스를 구현하는 클래스들은 인터페이스에 정의된 모든 메서드를 반드시 구현해야 함
public interface RemoCon {
    // TV, Radio의 공통 기능(함수, 메서드)을 정의
    // 다형성을 보장하기 위해서 등장된 개념
    // 서로다른 객체의 공통부분을 묶을 때 사용
    // 객체를 생성할 수 없음
    // 부모의 역할로 사용 가능하다(Upcasting)
    // 다중상속을 지원하기 위해서 사용됨

    // 채널 올리기 메서드
    // TV, Radio 등 리모컨으로 조작 가능한 기기들은 이 메서드를 구현해야 함
    public void chUp();

    // 채널 내리기 메서드
    // TV, Radio 등 리모컨으로 조작 가능한 기기들은 이 메서드를 구현해야 함
    public void chDown();

    // 볼륨 올리기 메서드
    // TV, Radio 등 리모컨으로 조작 가능한 기기들은 이 메서드를 구현해야 함
    public void volUP();

    // 볼륨 줄이기 메서드
    // TV, Radio 등 리모컨으로 조작 가능한 기기들은 이 메서드를 구현해야 함
    public void volDown();
}
