package kr.fc.poly2;

// 추상 클래스(불안전한 클래스)
// Animal 클래스는 추상 클래스로 선언
// 추상 클래스는 메서드의 원형만 정의하고 구현을 갖지 않는 불완전한 클래스
public abstract class Animal {
    // 1. 추상 메서드
    // 추상 메서드는 메서드의 원형(프로토타입)만을 선언하고, 중괄호 블록으로 구현부가 없음
    // 구현은 해당 메서드를 상속받는 서브클래스에서 이루어짐
    public abstract void eat(); // 메서드의 머리(원형, 프로토타입) -> 구현부가 없음

    // 2. 구현 메서드
    // 구현 메서드는 일반적인 메서드 형태로, 중괄호 블록 안에 구현 내용이 포함되어 있음
    // Animal 클래스의 구현 메서드인 move()는 "동물이 이동한다."라는 메시지를 출력
    public void move() {
        System.out.println("동물이 이동한다.");
    }
}
